In [6]:
import pandas as pd
import pandera as pa

In [5]:
s: pd.Series = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s: pd.Series = pd.Series((1,2,3,4,5),dtype="int32")
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [10]:
values: list[int]= [1,2,3,4,5]

index1 : list[str]= ["a","b","c","d","e"]
s: pd.Series = pd.Series(values,index=index1)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
values: list[int]= [1,2,3,4,5]

index1 : list[list[str]]= [["a1","a1","a1","b1","b1"],
                           ["a","b","c","d","e"]]
s: pd.Series = pd.Series(values,index=index1,name="Student Data")
s

a1  a    1
    b    2
    c    3
b1  d    4
    e    5
Name: Student Data, dtype: int64

# DataFrame

In [13]:
names:pd.Series = pd.Series(["Talha","Junaid","Ali","Mubashir","Amir"],name="Names")
grade:pd.Series = pd.Series([43,23,66,34,22],name="Grades")
rollNo:pd.Series = pd.Series([1,2,3,4,5],name="Roll No")
df:pd.DataFrame = pd.DataFrame({"Names":names,"Grades":grade,"Roll No.":rollNo})
df

      Names  Grades  Roll No.
0     Talha      43         1
1    Junaid      23         2
2       Ali      66         3
3  Mubashir      34         4
4      Amir      22         5

In [16]:
df:pd.DataFrame = pd.concat([names,grade,rollNo],axis=1)
df

      Names  Grades  Roll No
0     Talha      43        1
1    Junaid      23        2
2       Ali      66        3
3  Mubashir      34        4
4      Amir      22        5

In [18]:
_3d : list[list[int]]=[[1,2,3],
                       [4,5,6],
                       [7,8,9]]
df:pd.DataFrame = pd.DataFrame(_3d)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
_3d : list[list[int]]=[[1,2,3],
                       [4,5,6],
                       [7,8,9]]
df:pd.DataFrame = pd.DataFrame(_3d,index=["r1","r2","r3"],columns=["c1","c2","c3"])
df

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9

In [8]:
from nptyping import NDArray,Shape,Int64
import numpy as np
arr:NDArray[Shape["10,10"],Int64]= np.arange(10*10).reshape(10,10)
arr

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [12]:
df: pd.DataFrame = pd.DataFrame(arr,index= ["a","b","c","d","f","g","h","i","j","k",])
df

    0   1   2   3   4   5   6   7   8   9
a   0   1   2   3   4   5   6   7   8   9
b  10  11  12  13  14  15  16  17  18  19
c  20  21  22  23  24  25  26  27  28  29
d  30  31  32  33  34  35  36  37  38  39
f  40  41  42  43  44  45  46  47  48  49
g  50  51  52  53  54  55  56  57  58  59
h  60  61  62  63  64  65  66  67  68  69
i  70  71  72  73  74  75  76  77  78  79
j  80  81  82  83  84  85  86  87  88  89
k  90  91  92  93  94  95  96  97  98  99

In [18]:
index1 : list[list[str]] = [['a1', 'a1', 'a1', 'b1', 'b1'],
                            ['a', 'b', 'c', 'd', 'e']]